const dogs = [{
	sort: "热",
	list: ["阿拉斯加", "边境牧羊犬", "博美", "柴犬", "哈士奇", "斗牛犬", "贵宾犬", "吉娃娃", "金毛", "卷毛比熊犬", "柯基", "拉布拉多", "秋田犬", "德国牧羊犬",
		"雪纳瑞",
		"萨摩耶"
	]
}, {
	sort: "A",
	list: ["阿芬品犬", "阿富汗猎犬", "阿拉斯加雪橇犬", "安娜托利亚牧羊犬", "啊彭泽牧羊犬", "澳大利亚牧牛犬", "澳大利亚卡尔比犬", "澳大利亚牧羊犬", "澳大利亚粗短尾牧牛犬",
		"澳大利亚梗",
		"阿扎瓦克犬", "阿根廷杜高犬", "爱尔兰峡谷梗", "爱尔兰猎狼犬", "爱尔兰梗", "阿兰獒犬", "爱尔兰红白赛特犬", "爱尔兰赛特犬", "爱尔兰软毛麦色梗", "爱尔兰水猎犬"
	]
}, {
	sort: "B",
	list: ["巴贝特犬", "贝吉生犬", "布列塔尼短腿猎犬", "巴吉度猎犬", "巴伐利亚山猎犬", "比格犬", "贝德灵顿梗", "比利时拉坎诺斯牧羊犬", "比利时马利诺斯牧羊犬", "比利时牧羊犬",
		"比利时特弗伦牧羊犬", "贝加马斯卡牧羊犬", "伯恩山犬", "比弗梗预备役", "布鲁克浣熊猎犬", "波西米亚牧羊犬", "博洛涅塞犬", "边境牧羊犬", "边境梗", "波士顿梗", "波旁指示猎犬",
		"比利牛斯指示猎犬", "伯瑞犬", "布列塔尼猎犬", "布罗荷马獒", "布鲁塞尔格里芬犬", "波尔多獒犬", "北海道犬", "冰岛牧羊犬", "北京犬", "波兰低地牧羊犬", "博美犬", "八哥犬",
		"波利犬", "波密犬", "比利牛斯獒犬", "比利牛斯牧羊犬", "捕鼠梗", "波隆卡犬", "北非猎犬", "博伊金猎犬", "标准雪纳瑞", "波黑犬"
	]
}, {
	sort: "C",
	list: ["长须柯利牧羊犬", "瓷器犬", "柴犬", "藏獒", "川斯威尼亚猎犬", "丛林浣熊猎犬"]
}, {
	sort: "D",
	list: ["斗牛犬", "斗牛獒", "大麦町犬", "丹迪丁蒙梗", "丹麦瑞典农场犬", "德国水猎犬", "杜宾犬", "德国长毛指示猎犬", "德国品犬", "德国牧羊犬", "德国狐狸犬",
		"大巴塞特格里芬旺达犬", "大丹犬", "大白熊犬", "大瑞士山地犬", "德国猎梗", "德国短毛指示犬", "德国刚毛指示犬"
	]
}, {
	sort: "E",
	list: ["俄罗斯黑梗", "恩特雷布赫山地犬", "俄罗斯玩具犬预备役", "俄国莱卡犬"]
}, {
	sort: "F",
	list: ["法国狼犬", "法兰德斯畜牧犬", "芬兰拉普猎犬", "芬兰狐狸犬", "法国猎犬", "法国猎犬", "法国斗牛犬", "芬兰驯鹿犬", "法老王猎犬"]
}, {
	sort: "G",
	list: ["高加索牧羊犬", "刚毛猎狐梗", "古代英国牧羊犬", "贵宾犬", "戈登赛特犬", "刚毛指示格里芬犬", "刚毛维兹拉犬", "工作卡尔比犬"]
}, {
	sort: "H",
	list: ["黑褐猎浣熊犬", "荷兰水猎犬", "荷兰牧羊犬预备役", "汉密尔顿猎犬", "汉挪威猎犬", "哈利犬", "哈瓦那犬", "霍夫瓦尔特犬", "韩国金多犬", "荷兰毛狮犬", "湖畔梗",
		"蝴蝶犬",
		"红骨浣熊猎犬", "惠比特犬"
	]
}, {
	sort: "J",
	list: ["卷毛比雄犬", "加泰霍拉豹犬", "捷克梗", "吉娃娃", "捷克狼犬", "巨型雪纳瑞", "甲斐犬", "纪州犬", "加纳利犬", "卷毛寻回犬", "金毛寻回犬"]
}, {
	sort: "K",
	list: ["凯恩梗", "卡南犬", "卡斯罗犬", "卡迪根威尔士柯基犬", "卡罗利娜犬", "柯利犬", "克罗地亚牧羊犬", "卡累利熊犬", "凯利蓝梗", "可蒙犬", "克罗姆费兰德犬", "库瓦兹犬",
		"科克尔犬", "克伦博猎犬"
	]
}, {
	sort: "L",
	list: ["腊肠犬", "猎狐梗", "灵提犬", "罗曼那水犬", "兰夏尔犬预备役", "兰博格犬", "拉萨犬", "罗秦犬", "罗威士挭", "猎水獭犬", "拉布拉多寻回犬", "罗得西亚脊背犬",
		"罗马尼亚米利泰克牧羊犬", "罗威纳犬", "罗素梗"
	]
}, {
	sort: "M",
	list: ["美国斗牛犬后备预备犬组", "美式英国浣熊猎犬", "美国爱斯基摩犬", "美国猎狐犬", "美洲豹猎犬", "美国无毛梗", "美国斯塔福梗", "棉花面纱犬", "玛尔济斯", "曼彻斯特梗",
		"马士提夫犬", "迷你美国牧羊犬", "迷你牛头梗", "迷你杜宾犬", "迷你雪纳瑞", "马地犬预备役", "秘鲁无毛犬预备役", "迷你贝吉格里芬凡丁犬", "美国水猎犬", "美国可卡犬", "墨西哥无毛犬"
	]
}, {
	sort: "N",
	list: ["南非獒犬", "牛头梗", "纽波利顿獒犬", "纽芬兰犬", "诺福克梗", "诺波丹狐狸犬预备役", "挪威布哈德犬", "挪威猎麋犬", "挪威伦德猎犬"]
}, {
	sort: "O",
	list: ["欧亚大陆犬"]
}, {
	sort: "P",
	list: ["皮卡第牧羊犬", "帕森罗素梗", "彭布鲁克威尔士柯基犬", "普罗特猎犬", "葡萄牙波登哥犬预备役", "葡萄牙指示猎犬", "葡萄牙牧羊犬", "葡萄牙水犬", "普德尔指示猎犬", "平毛寻回犬"]
}, {
	sort: "Q",
	list: ["秋田犬", "拳狮犬", "骑士查理王小猎犬", "奇努克犬", "切萨诺皮湾寻回犬"]
}, {
	sort: "R",
	list: ["瑞典腊肠犬", "日本狆", "日本狐狸犬", "瑞典拉普猎犬", "瑞典柯基犬"]
}, {
	sort: "S",
	list: ["苏俄猎狼犬", "松狮犬", "山犬", "圣伯纳犬", "萨卢基犬", "萨摩耶犬", "斯恰潘道夫犬", "史其派克犬", "苏格兰猎鹿犬", "苏格兰梗", "四国犬", "丝毛梗", "斯开岛梗",
		"斯洛伐克刚毛指示猎犬", "斯洛伐克库瓦克犬", "斯洛伐克猎犬", "苏塞克斯猎犬", "史毕诺犬", "斯塔比荷犬", "斯塔福郡斗牛梗"
	]
}, {
	sort: "T",
	list: ["田野猎犬", "台湾犬", "泰迪罗斯福犬预备役", "泰国脊背犬", "土佐犬", "田纳西树猎犬"]
}, {
	sort: "W",
	list: ["万能梗", "威尔士史宾格犬", "玩具猎狐梗", "维兹拉犬", "魏玛犬", "威尔士梗", "韦特豪犬"]
}, {
	sort: "X",
	list: ["寻血猎犬", "西西里猎犬", "小型葡萄牙波登哥犬", "新斯科舍诱鸭寻回犬", "西里汉姆梗", "喜乐蒂牧羊犬", "西施犬", "西伯利亚雪橇犬", "小明斯特兰德犬", "西班牙獒犬",
		"西班牙水犬", "西藏猎犬", "西藏梗", "西高地白梗"
	]
}, {
	sort: "Y",
	list: ["意大利指示猎犬预备役", "英国猎狐犬", "英国玩具猎鹬犬", "伊斯特啦山地犬", "依比赞猎犬", "意大利灵缇犬", "英国赛特犬", "英国可卡犬", "英国史宾格犬", "约克夏"]
}, {
	sort: "Z",
	list: ["中亚牧羊犬", "中国冠毛犬", "中国沙皮犬", "中华田园犬", "指示犬"]
}]

const cats = [{
	sort: "热",
	list: ["波斯猫", "布偶猫", "暹罗猫", "黑猫", "加菲猫", "金吉拉", "橘猫", "狸花猫", "美国短毛猫", "缅因猫", "奶牛猫", "英短蓝白", "银渐层", "金渐层",
		"中华田园猫",
		"英短蓝猫"
	]
}, {
	sort: "A",
	list: ["阿比西尼亚猫", "阿瑟拉猫", "澳大利亚雾猫", "埃及猫"]
}, {
	sort: "B",
	list: ["布偶猫", "波斯猫", "豹猫", "伯曼猫", "彼得秃猫", "巴厘岛猫"]
}, {
	sort: "C",
	list: ["茶杯猫"]
}, {
	sort: "D",
	list: ["德文卷毛猫", "蒂凡尼猫", "东方短毛猫", "东奇尼猫"]
}, {
	sort: "E",
	list: ["俄罗斯蓝猫"]
}, {
	sort: "J",
	list: ["加菲猫", "加拿大无毛猫", "金吉拉猫", "加州闪亮猫"]
}, {
	sort: "K",
	list: ["卡尔特猫", "柯尼斯卷毛猫"]
}, {
	sort: "L",
	list: ["褴褛猫"]
}, {
	sort: "M",
	list: ["缅因猫", "美国短毛猫", "曼基康猫", "美国刚毛猫", "美国卷耳猫", "孟买猫", "美国短尾猫", "美国反耳猫"]
}, {
	sort: "N",
	list: ["奶牛猫", "挪威森林猫"]
}, {
	sort: "S",
	list: ["斯芬克斯猫", "苏格兰折耳猫", "山东狮子猫", "沙特尔猫", "索马里猫"]
}, {
	sort: "T",
	list: ["土耳其梵猫"]
}, {
	sort: "W",
	list: ["玩具虎猫", "威尔斯猫"]
}, {
	sort: "X",
	list: ["喜马拉雅猫", "暹罗猫", "西伯利亚森林猫", "雪鞋猫"]
}, {
	sort: "Y",
	list: ["英国短毛猫", "异国短毛猫", "英国长毛猫", "英短蓝白"]
}, {
	sort: "Z",
	list: ["中国狸花猫"]
}]

const other = [{
	sort: "A",
	list: ["安哥拉兔", "安格鲁貂"]
}, {
	sort: "B",
	list: ["豹纹守宫", "捕鸟蛛", "白桂鸡", "白头翁"]
}, {
	sort: "C",
	list: ["仓鼠", "刺猬", "垂耳兔", "草龟"]
}, {
	sort: "D",
	list: ["道奇兔子", "大眼飞鼠", "地图龟"]
}, {
	sort: "E",
	list: ["鹅", "鳄鱼"]
}, {
	sort: "G",
	list: ["蝈蝈", "龟", "鸽子", "守宫"]
}, {
	sort: "H",
	list: ["狐狸", "花枝鼠", "荷兰猪", "蝴蝶", "浣熊"]
}, {
	sort: "J",
	list: ["寄居蟹", "金斯熊", "角蛙", "甲虫", "金鱼", "金钱龟"]
}, {
	sort: "K",
	list: ["科尔鸭"]
}, {
	sort: "L",
	list: ["龙猫"]
}, {
	sort: "M",
	list: ["蚂蚁", "猫猫兔"]
}, {
	sort: "N",
	list: ["鸟", "男朋友"]
}, {
	sort: "S",
	list: ["松鼠", "蛇"]
}, {
	sort: "T",
	list: ["兔子", "泰狮"]
}, {
	sort: "W",
	list: ["蜗牛", "乌龟"]
}, {
	sort: "X",
	list: ["蜥蜴", "雪貂", "小白鼠"]
}, {
	sort: "Y",
	list: ["羊驼", "银狐", "元宝鸡", "鹰嘴龟"]
}]

module.exports = {
	dogs,
	cats,
	other
}